SmartkomDev/GraftCore/GraftCoreX/boards.txt
menu.clock=Clock
menu.BOD=BOD
menu.pinout=Pinout
menu.resetpin=Reset pin
menu.bootloader=Bootloader


####################
#### Graft Uno ####
####################

# General
graft_uno.name=Graft Uno
graft_uno.upload.tool=avrdude
graft_uno.upload.maximum_data_size=6144
graft_uno.upload.speed=115200
graft_uno.bootloader.tool=avrdude
graft_uno.build.core=coreX-corefiles
graft_uno.build.board=AVR_ATmega4809
graft_uno.build.mcu=atmega4809
graft_uno.build.extra_flags={build.oscillator} {build.compat}

# Fuses we don't need to modify in the tools menu
graft_uno.bootloader.WDTCFG=0x00
graft_uno.bootloader.TCD0CFG=0x00
graft_uno.bootloader.SYSCFG1=0x06
graft_uno.bootloader.APPEND=0x00
graft_uno.bootloader.LOCKBIT=0xC5

# Pinouts
graft_uno.menu.pinout.uno_rev_12=rev 1.2
graft_uno.menu.pinout.uno_rev_12.build.variant=graft-uno_rev-12
graft_uno.menu.pinout.uno_rev_12.build.compat=

graft_uno.menu.pinout.uno_rev_10=rev 1.0
graft_uno.menu.pinout.uno_rev_10.build.variant=graft-uno_rev-10
graft_uno.menu.pinout.uno_rev_10.build.compat=

# Reset pin
graft_uno.menu.resetpin.reset=Reset
graft_uno.menu.resetpin.reset.bootloader.SYSCFG0=0xC9
graft_uno.menu.resetpin.gpio=GPIO
graft_uno.menu.resetpin.gpio.bootloader.SYSCFG0=0xC5

# Brown out detection
graft_uno.menu.BOD.2v6=BOD 2.6V
graft_uno.menu.BOD.2v6.bootloader.BODCFG=0x54
graft_uno.menu.BOD.4v2=BOD 4.2V
graft_uno.menu.BOD.4v2.bootloader.BODCFG=0xF4
graft_uno.menu.BOD.4v0=BOD 4.0V
graft_uno.menu.BOD.4v0.bootloader.BODCFG=0xD4
graft_uno.menu.BOD.3v7=BOD 3.7V
graft_uno.menu.BOD.3v7.bootloader.BODCFG=0xB4
graft_uno.menu.BOD.3v3=BOD 3.3V
graft_uno.menu.BOD.3v3.bootloader.BODCFG=0x94
graft_uno.menu.BOD.2v9=BOD 2.9V
graft_uno.menu.BOD.2v9.bootloader.BODCFG=0x74
graft_uno.menu.BOD.2v1=BOD 2.1V
graft_uno.menu.BOD.2v1.bootloader.BODCFG=0x34
graft_uno.menu.BOD.1v8=BOD 1.8V
graft_uno.menu.BOD.1v8.bootloader.BODCFG=0x14
graft_uno.menu.BOD.disabled=BOD disabled
graft_uno.menu.BOD.disabled.bootloader.BODCFG=0x00

# Clock
graft_uno.menu.clock.internal_20MHz=Internal 20 MHz
graft_uno.menu.clock.internal_20MHz.upload.speed=115200
graft_uno.menu.clock.internal_20MHz.bootloader.OSCCFG=0x02
graft_uno.menu.clock.internal_20MHz.build.oscillator=
graft_uno.menu.clock.internal_20MHz.build.f_cpu=20000000L

graft_uno.menu.clock.internal_16MHz=Internal 16 MHz
graft_uno.menu.clock.internal_16MHz.upload.speed=115200
graft_uno.menu.clock.internal_16MHz.bootloader.OSCCFG=0x01
graft_uno.menu.clock.internal_16MHz.build.oscillator=
graft_uno.menu.clock.internal_16MHz.build.f_cpu=16000000L

graft_uno.menu.clock.internal_8MHz_div=Internal 8 MHz
graft_uno.menu.clock.internal_8MHz_div.upload.speed=115200
graft_uno.menu.clock.internal_8MHz_div.bootloader.OSCCFG=0x01
graft_uno.menu.clock.internal_8MHz_div.build.oscillator=
graft_uno.menu.clock.internal_8MHz_div.build.f_cpu=8000000L

graft_uno.menu.clock.internal_4MHz_div=Internal 4 MHz
graft_uno.menu.clock.internal_4MHz_div.upload.speed=115200
graft_uno.menu.clock.internal_4MHz_div.bootloader.OSCCFG=0x01
graft_uno.menu.clock.internal_4MHz_div.build.oscillator=
graft_uno.menu.clock.internal_4MHz_div.build.f_cpu=4000000L

graft_uno.menu.clock.internal_2MHz_div=Internal 2 MHz
graft_uno.menu.clock.internal_2MHz_div.upload.speed=115200
graft_uno.menu.clock.internal_2MHz_div.bootloader.OSCCFG=0x01
graft_uno.menu.clock.internal_2MHz_div.build.oscillator=
graft_uno.menu.clock.internal_2MHz_div.build.f_cpu=2000000L

graft_uno.menu.clock.internal_1MHz_div=Internal 1 MHz
graft_uno.menu.clock.internal_1MHz_div.upload.speed=115200
graft_uno.menu.clock.internal_1MHz_div.bootloader.OSCCFG=0x01
graft_uno.menu.clock.internal_1MHz_div.build.oscillator=
graft_uno.menu.clock.internal_1MHz_div.build.f_cpu=1000000L


# Bootloader
graft_uno.menu.bootloader.uart2_alternative=Bootloader
graft_uno.menu.bootloader.uart2_alternative.upload.maximum_size=48640
graft_uno.menu.bootloader.uart2_alternative.upload.protocol=arduino
graft_uno.menu.bootloader.uart2_alternative.upload.port=UART2_ALT
graft_uno.menu.bootloader.uart2_alternative.upload.extra_params=
graft_uno.menu.bootloader.uart2_alternative.build.text_section_start=.text=0x4000
graft_uno.menu.bootloader.uart2_alternative.bootloader.file=optiboot/graft_bootloader/graft_uno.hex
graft_uno.menu.bootloader.uart2_alternative.bootloader.BOOTEND=0x02
graft_uno.menu.bootloader.uart2_alternative.bootloader.SYSCFG0=0xC9

graft_uno.menu.bootloader.no_bootloader=No bootloader
graft_uno.menu.bootloader.no_bootloader.upload.maximum_size=49152
graft_uno.menu.bootloader.no_bootloader.upload.extra_params=
graft_uno.menu.bootloader.no_bootloader.build.text_section_start=.text=0x0
graft_uno.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex
graft_uno.menu.bootloader.no_bootloader.bootloader.BOOTEND=0x00





####################
#### Graft Out 8DXXX ####
####################

# General
graftout8d.name=Graft Output 8DXXX
graftout8d.upload.tool=avrdude
graftout8d.upload.maximum_data_size=6144
graftout8d.upload.speed=115200
graftout8d.bootloader.tool=avrdude
graftout8d.build.core=coreX-corefiles
graftout8d.build.board=AVR_ATmega4809
graftout8d.build.mcu=atmega4809
graftout8d.build.extra_flags={build.oscillator} {build.compat}

# Fuses we don't need to modify in the tools menu
graftout8d.bootloader.WDTCFG=0x00
graftout8d.bootloader.TCD0CFG=0x00
graftout8d.bootloader.SYSCFG1=0x06
graftout8d.bootloader.APPEND=0x00
graftout8d.bootloader.LOCKBIT=0xC5

# Pinouts
graftout8d.menu.pinout.out8d_rev_30=rev 3.0
graftout8d.menu.pinout.out8d_rev_30.build.variant=graft-output8d_rev_30
graftout8d.menu.pinout.out8d_rev_30.build.compat=

graftout8d.menu.pinout.out8d_rev_21=rev 2.1
graftout8d.menu.pinout.out8d_rev_21.build.variant=graft-output8d_rev_21
graftout8d.menu.pinout.out8d_rev_21.build.compat=

graftout8d.menu.pinout.out8d_rev_10=rev 1.0
graftout8d.menu.pinout.out8d_rev_10.build.variant=graft-output8d_rev_10
graftout8d.menu.pinout.out8d_rev_10.build.compat=


# Reset pin
graftout8d.menu.resetpin.reset=Reset
graftout8d.menu.resetpin.reset.bootloader.SYSCFG0=0xC9
graftout8d.menu.resetpin.gpio=GPIO
graftout8d.menu.resetpin.gpio.bootloader.SYSCFG0=0xC5

# Brown out detection
graftout8d.menu.BOD.2v6=BOD 2.6V
graftout8d.menu.BOD.2v6.bootloader.BODCFG=0x54
graftout8d.menu.BOD.4v2=BOD 4.2V
graftout8d.menu.BOD.4v2.bootloader.BODCFG=0xF4
graftout8d.menu.BOD.4v0=BOD 4.0V
graftout8d.menu.BOD.4v0.bootloader.BODCFG=0xD4
graftout8d.menu.BOD.3v7=BOD 3.7V
graftout8d.menu.BOD.3v7.bootloader.BODCFG=0xB4
graftout8d.menu.BOD.3v3=BOD 3.3V
graftout8d.menu.BOD.3v3.bootloader.BODCFG=0x94
graftout8d.menu.BOD.2v9=BOD 2.9V
graftout8d.menu.BOD.2v9.bootloader.BODCFG=0x74
graftout8d.menu.BOD.2v1=BOD 2.1V
graftout8d.menu.BOD.2v1.bootloader.BODCFG=0x34
graftout8d.menu.BOD.1v8=BOD 1.8V
graftout8d.menu.BOD.1v8.bootloader.BODCFG=0x14
graftout8d.menu.BOD.disabled=BOD disabled
graftout8d.menu.BOD.disabled.bootloader.BODCFG=0x00

# Clock
graftout8d.menu.clock.internal_20MHz=Internal 20 MHz
graftout8d.menu.clock.internal_20MHz.upload.speed=115200
graftout8d.menu.clock.internal_20MHz.bootloader.OSCCFG=0x02
graftout8d.menu.clock.internal_20MHz.build.oscillator=
graftout8d.menu.clock.internal_20MHz.build.f_cpu=20000000L

